string = 'Нільс Бор народився в родині професора фізіології Копенгагенського університету Християна Бора (1858—1911) '\
         'й Еллен Адлер (1860—1930). Батьки Бора одружилися 1881 року.'\
'Батька Нільса Бора двічі висували кандидатом на Нобелівську премію з фізіології або медицини[6]. '\
'Мати була донькою впливового та вельми заможного єврейського банкіра і парламентаря-ліберала Давида/'\
'Баруха Адлера[da] (1826—1878) і Дженні Рафаел (1830—1902) із британської єврейської банкірської династії Raphael ' \
'Raphael & sons '


def count_digits(srt):
    count = 0
    for i in srt:
        if i.isdigit():
            count += 1

    return count

def count_numbers(srt):
    count = 0
    pos = 0
    while pos < len(srt):
        if srt[pos].isdigit():
            while srt[pos].isdigit():
                pos += 1
            count += 1
        else:
            pos += 1

    return count

print(count_numbers(string))
